<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<dict>

<!-- (Facultatif, mais fortement recommandé) Description utile de la recette et des valeurs spécifiques à l'application que l'administrateur peut souhaiter remplacer. -->
    <key>Description</key>
    <string>Télécharge la dernière image disque AdobeReader et l’importe dans Munki.</string>

<!-- Une chaîne unique identifiant cette recette. Un format suggéré pour l'identifiant est une chaîne de domaine inversé suivie du type de recette et du nom du produit. -->
    <key>Identifier</key>
    <string>com.github.INSERM-TLS.download.AdobeReader</string>

<!-- Ensemble de variables que l'administrateur peut remplacer sans avoir à modifier directement les paramètres ou la logique de la recette elle-même. -->
    <key>Input</key>
    <dict>
        <key>LANGUAGE</key>
        <string>English</string>
        <key>MAJOR_VERSION</key>
        <string>11</string>
        <key>OS_VERSION</key>
        <string>10.8.0</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Adobe</string>
        <key>NAME</key>
        <string>AdobeReader</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
	       	<string>Adobe Acrobat Pro.app</string>
	        <string>Adobe Acrobat Reader DC.app</string>
	        <string>Adobe Acrobat.app</string>
	        <string>Adobe Reader.app</string>
            </array>
            <key>catalogs</key>
            <array>
<!-- (Facultatif) Implémente l'application téléchargé dans le catalog "testing" pour permettre par le suite à l'administrateur de la passer dans le catalog "Prod" si il est satisfait de la mise a jour de cette application -->
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Adobe® Reader® is the global standard for reliably viewing, printing, and commenting on PDF documents. It&apos;s the only PDF file viewer that can open and interact with all types of PDF content, including forms and multimedia.</string>
            <key>display_name</key>
            <string>Adobe Reader</string>
            <key>minimum_os_version</key>
            <string>10.6.4</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>preinstall_script</key>
            <string>#!/bin/sh
if [ -e "/Applications/Adobe Reader.app" ]; then
rm -r "/Applications/Adobe Reader.app"
fi
exit 0
            </string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>

<!-- (Facultatif) Version minimale de autopkg requise pour exécuter cette recette. -->
    <key>MinimumVersion</key>
    <string>0.2.0</string>

<!-- (Facultatif) Si cette recette hérite des "Inputs" et des "Process" d'une autre recette, cela existe et correspond à l''Identifier' de la recette parent. -->
    <key>ParentRecipe</key>
    <string>com.github.INSERM-TLS.download.AdobeReader</string>

<!-- Séquence de processeurs utilisés pour exécuter la recette, ainsi que leurs paramètres. -->
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
<!-- Compresse un package développé à l'aide de pkgutil. -->
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
            <key>Processor</key>
<!-- Crée une racine de package et une structure de répertoire. -->
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_unpack/application.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
<!-- Déballer une charge de paquet. -->
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/application_payload</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/Adobe Reader.app</string>
                </array>
            </dict>
            <key>Processor</key>
<!-- Génère un tableau d’installations pour un fichier pkginfo. -->
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
<!-- Fusionne deux dictionnaires pkginfo. -->
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
<!-- Importe un ".pkg" ou une ".dmg" dans le dépôt Munki. -->
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>