<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<dict>

<!-- (Facultatif, mais fortement recommandé) Description utile de la recette et des valeurs spécifiques à l'application que l'administrateur peut souhaiter remplacer. -->
	<key>Description</key>
	<string>Downloads the latest version of Fiji and imports it into Munki.</string>

<!-- Une chaîne unique identifiant cette recette. Un format suggéré pour l'identifiant est une chaîne de domaine inversé suivie du type de recette et du nom du produit. -->
	<key>Identifier</key>
	<string>com.github.INSERM-TLS.munki.Fiji</string>

<!-- Ensemble de variables que l'administrateur peut remplacer sans avoir à modifier directement les paramètres ou la logique de la recette elle-même. -->
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Fiji</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
<!-- (Facultatif) Implémente l'application téléchargé dans le catalog "testing" pour permettre par le suite à l'administrateur de la passer dans le catalog "Prod" si il est satisfait de la mise a jour de cette application -->
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Biology</string>
			<key>description</key>
			<string>Fiji is an image processing package. It can be described as a distribution of ImageJ (and ImageJ2) together with Java, Java3D and a lot of plugins organized into a coherent menu structure. Fiji compares to ImageJ as Ubuntu compares to Linux.</string>
			<key>developer</key>
			<string>Fiji</string>
			<key>display_name</key>
			<string>Fiji</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>

<!-- (Facultatif) Version minimale de autopkg requise pour exécuter cette recette. -->
	<key>MinimumVersion</key>
	<string>0.5.0</string>

<!-- (Facultatif) Si cette recette hérite des "Inputs" et des "Process" d'une autre recette, cela existe et correspond à l''Identifier' de la recette parent. -->
	<key>ParentRecipe</key>
	<string>com.github.INSERM-TLS.download.Fiji</string>

<!-- Séquence de processeurs utilisés pour exécuter la recette, ainsi que leurs paramètres. -->
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
<!-- Importe un ".pkg" ou une ".dmg" dans le dépôt Munki. -->
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>