<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads FlowJo</string>
    <key>Identifier</key>
    <string>com.github.INSERM-TLS.download.FlowJo</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FlowJo</string>
        <key>INDEX_URL</key>
        <string>https://www.flowjo.com/solutions/flowjo/downloads</string>
        <key>SEARCH_PATTERN_URL</key>
    		<string>https://s3-us-west-2.amazonaws.com/fjinstallers/FlowJo-OSX64-[0-9][0-9].[0-9]?[0-9].[0-9]?[0-9].dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
      <dict>
  			<key>Arguments</key>
  			<dict>
  				<key>re_pattern</key>
  				<string>%SEARCH_PATTERN_URL%</string>
  				<key>url</key>
  				<string>%INDEX_URL%</string>
  			</dict>
  			<key>Processor</key>
  			<string>URLTextSearcher</string>
  		</dict>
  		<dict>
  			<key>Arguments</key>
  			<dict>
  				<key>filename</key>
  				<string>%NAME%.dmg</string>
  				<key>url</key>
  				<string>%match%</string>
  			</dict>
  			<key>Processor</key>
  			<string>URLDownloader</string>
  		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>