<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<dict>

<!-- (Facultatif, mais fortement recommandé) Description utile de la recette et des valeurs spécifiques à l'application que l'administrateur peut souhaiter remplacer. -->
	<key>Description</key>
	<string>Télécharge la dernière image disque Flowjo et l’importe dans Munki.</string>

<!-- Une chaîne unique identifiant cette recette. Un format suggéré pour l'identifiant est une chaîne de domaine inversé suivie du type de recette et du nom du produit. -->
	<key>Identifier</key>
	<string>com.github.INSERM-TLS.munki.FlowJo</string>

<!-- Ensemble de variables que l'administrateur peut remplacer sans avoir à modifier directement les paramètres ou la logique de la recette elle-même. -->
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>FlowJo</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
<!-- (Facultatif) Implémente l'application téléchargé dans le catalog "testing" pour permettre par le suite à l'administrateur de la passer dans le catalog "Prod" si il est satisfait de la mise a jour de cette application -->
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Science</string>
			<key>description</key>
			<string>The FlowJo® workspace is a powerful statistical environment that is used for immunophenotyping, cell cycle, proliferation, kinetics studies, quantitative population comparison, or plate screening assays to name a few.</string>
			<key>developer</key>
			<string>FlowJo</string>
			<key>display_name</key>
			<string>FlowJo</string>
			<key>minimum_os_version</key>
			<string>10.7</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>items_to_copy</key>
	    <array>
	        <dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>FlowJo.app</string>
		 </dict>
		 <dict>
			<key>destination_path</key>
			<string>/Applications/FlowJo.app/Contents/Resources</string>
			<key>source_item</key>
			<string>plugins</string>
		 </dict>
	    </array>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# FlowJo offers a plugin system, where the user can add new plugins by
# adding them to a plugins folder in the Application folder.
# To prevent confusion we create a new folder called "Plugins for FlowJo"
# (instead of just plugins) and link it with the now invisible plugins folder.
cd /Applications
ln -s /Applications/FlowJo.app/Contents/Resources/plugins/
ln -s /Applications/FlowJo.app/Contents/Resources/plugins/ "Plugins for FlowJo"
chflags -h hidden plugins
cd /Applications/FlowJo.app/Contents/Resources/
chmod 777 plugins
			</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
rm -rf /Applications/plugins
rm -rf "/Applications/Plugins for FlowJo"
			</string>
		</dict>
	</dict>

<!-- (Facultatif) Version minimale de autopkg requise pour exécuter cette recette. -->
	<key>MinimumVersion</key>
	<string>1.0.0</string>

<!-- (Facultatif) Si cette recette hérite des "Inputs" et des "Process" d'une autre recette, cela existe et correspond à l''Identifier' de la recette parent. -->
	<key>ParentRecipe</key>
	<string>com.github.INSERM-TLS.download.FlowJo</string>

<!-- Séquence de processeurs utilisés pour exécuter la recette, ainsi que leurs paramètres. -->
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
<!-- Importe un ".pkg" ou une ".dmg" dans le dépôt Munki. -->
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>