<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<dict>

<!-- (Facultatif, mais fortement recommandé) Description utile de la recette et des valeurs spécifiques à l'application que l'administrateur peut souhaiter remplacer. -->
    <key>Description</key>
    <string>Télécharge la dernière image disque de FlowJo</string>

<!-- Une chaîne unique identifiant cette recette. Un format suggéré pour l'identifiant est une chaîne de domaine inversé suivie du type de recette et du nom du produit. -->
    <key>Identifier</key>
    <string>com.github.INSERM-TLS.download.FlowJo</string>

<!-- Ensemble de variables que l'administrateur peut remplacer sans avoir à modifier directement les paramètres ou la logique de la recette elle-même. -->
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FlowJo</string>
        <key>INDEX_URL</key>
        <string>https://www.flowjo.com/solutions/flowjo/downloads</string>
        <key>SEARCH_PATTERN_URL</key>
    		<string>https://s3-us-west-2.amazonaws.com/fjinstallers/FlowJo-OSX64-[0-9][0-9].[0-9]?[0-9].[0-9]?[0-9].dmg</string>
    </dict>

<!-- (Facultatif) Version minimale de autopkg requise pour exécuter cette recette. -->
    <key>MinimumVersion</key>
    <string>1.0.0</string>

<!-- Séquence de processeurs utilisés pour exécuter la recette, ainsi que leurs paramètres. -->
    <key>Process</key>
    <array>
      <dict>
  			<key>Arguments</key>
  			<dict>
  				<key>re_pattern</key>
  				<string>%SEARCH_PATTERN_URL%</string>
  				<key>url</key>
  				<string>%INDEX_URL%</string>
  			</dict>
  			<key>Processor</key>
<!-- Télécharge une URL à l'aide de curl et effectue une correspondance d'expression régulière sur le texte. -->
  			<string>URLTextSearcher</string>
  		</dict>
  		<dict>
  			<key>Arguments</key>
  			<dict>
  				<key>filename</key>
  				<string>%NAME%.dmg</string>
  				<key>url</key>
  				<string>%match%</string>
  			</dict>
  			<key>Processor</key>
<!-- Ce processeur télécharge une URL dans le dossier de cache de la recette et enregistre également certaines métadonnées fournies par l'en-tête de réponse du serveur Web:"Content-Length" et "ETag", si l'une ou l'autre est disponible.
Si la recette est exécutée une deuxième fois, elles sont utilisées pour comparer notre copie en cache avec celle actuellement disponible à l'URL de téléchargement.
Cela signifie qu'il est possible d'exécuter la recette plusieurs fois et de savoir qu'elle ne téléchargera pas à nouveau le fichier à chaque fois, mais qu'elle vérifiera à chaque fois. -->
  			<string>URLDownloader</string>
  		</dict>
        <dict>
            <key>Processor</key>
<!-- C'est un processeur factice utilisé uniquement par autopkg pour arrêter le traitement de la recette si l'option "check" a été donnée. Cela permet d'autopkg d'être exécuté selon un calendrier et de ne pas exécuter un traitement complet à chaque fois, s'il le juge nécessaire.
Nous partons du principe que si nous l'avons mis en cache, nous avons déjà traité le reste de la recette, ce qui correspond généralement à toutes les étapes de post-traitement finales et à son importation dans un référentiel.
Puisque cette étape est à la fin de cette recette de téléchargement, cela n’a vraiment aucun effet; mais lorsqu'une recette téléchargée est utilisée comme base pour une recette importée dans Munki ou générant un package, cette étape devient plus utile. -->
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>