<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Zotero</string>
	<key>Identifier</key>
	<string>com.github.CRCT-recipe.recipe.download.zotero</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zotero</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.zotero.org/download/</string>
				<key>re_pattern</key>
				<string>&quot;mac&quot;:&quot;(?P&lt;version&gt;.*?)&quot;</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.zotero.org/download/client/dl?channel=release&amp;platform=mac&amp;version=%version%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
	/Volumes/CRCT_S.Communs/02Informatique/99munki		</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Zotero.app</string>
				<key>requirement</key>
				<string>identifier "org.zotero.zotero" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8LAYR367YV"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
