<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<dict>

<!-- (Facultatif, mais fortement recommandé) Description utile de la recette et des valeurs spécifiques à l'application que l'administrateur peut souhaiter remplacer. -->
	<key>Description</key>
	<string>Downloads the latest version of GIMP from gimp.org and imports into Munki.</string>

<!-- Une chaîne unique identifiant cette recette. Un format suggéré pour l'identifiant est une chaîne de domaine inversé suivie du type de recette et du nom du produit. -->
	<key>Identifier</key>
	<string>com.github.INSERM-TLS.munki.GIMP</string>

<!-- Ensemble de variables que l'administrateur peut remplacer sans avoir à modifier directement les paramètres ou la logique de la recette elle-même. -->
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GIMP</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/GIMP</string>
		<key>MUNKI_CATEGORY</key>
		<string>Image Manipulation</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Gimp</string>
				<string>GIMP</string>
			</array>
			<key>catalogs</key>
			<array>
<!-- (Facultatif) Implémente l'application téléchargé dans le catalog "testing" pour permettre par le suite à l'administrateur de la passer dans le catalog "Prod" si il est satisfait de la mise a jour de cette application -->
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>GIMP is the GNU Image Manipulation Program. It is a freely distributed piece of software for such tasks as photo retouching, image composition and image authoring. It works on many operating systems, in many languages.</string>
			<key>developer</key>
			<string>The GIMP Team</string>
			<key>display_name</key>
			<string>GIMP</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>

<!-- (Facultatif) Version minimale de autopkg requise pour exécuter cette recette. -->
	<key>MinimumVersion</key>
	<string>0.5.2</string>

<!-- (Facultatif) Si cette recette hérite des "Inputs" et des "Process" d'une autre recette, cela existe et correspond à l''Identifier' de la recette parent. -->
	<key>ParentRecipe</key>
	<string>com.github.INSERM-TLS.download.GIMP</string>

<!-- Séquence de processeurs utilisés pour exécuter la recette, ainsi que leurs paramètres. -->
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>GIMP binary has execute bits only for owner. This needs to be fixed before MunkiImporter.</string>
			<key>Processor</key>
<!-- Copie chemin_source vers chemin_destination. -->
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/G[iI][mM][pP]*.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/GIMP.app</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
<!-- Fournit l'URL de la dernière version de GIMP -->
			<string>GIMPPermissionsFixer</string>
			<key>Arguments</key>
			<dict>
				<key>gimp_app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/GIMP.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
<!-- Crée une image disque à partir d'un répertoire. -->
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
<!-- Importe un ".pkg" ou une ".dmg" dans le dépôt Munki. -->
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>