<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<dict>

<!-- (Facultatif, mais fortement recommandé) Description utile de la recette et des valeurs spécifiques à l'application que l'administrateur peut souhaiter remplacer. -->
    <key>Description</key>
    <string>Télécharge la dernière image disque de Firefox</string>

<!-- Une chaîne unique identifiant cette recette. Un format suggéré pour l'identifiant est une chaîne de domaine inversé suivie du type de recette et du nom du produit. -->
    <key>Identifier</key>
    <string>com.github.INSERM-TLS.download.Firefox</string>

<!-- Ensemble de variables que l'administrateur peut remplacer sans avoir à modifier directement les paramètres ou la logique de la recette elle-même. -->
    <key>Input</key>
    <dict>
        <key>RELEASE</key>
        <string>latest</string>
        <key>LOCALE</key>
        <string>fr_FR</string>
        <key>NAME</key>
        <string>Firefox</string>
        <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        <false/>
    </dict>

<!-- (Facultatif) Version minimale de autopkg requise pour exécuter cette recette. -->
    <key>MinimumVersion</key>
    <string>0.4.1</string>

<!-- Séquence de processeurs utilisés pour exécuter la recette, ainsi que leurs paramètres. -->
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>product_name</key>
                <string>firefox</string>
                <key>release</key>
                <string>%RELEASE%</string>
                <key>locale</key>
                <string>%LOCALE%</string>
            </dict>
            <key>Processor</key>
<!-- Fournit l'URL de la dernière version de Firefox -->
            <string>MozillaURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
<!-- Ce processeur télécharge une URL dans le dossier de cache de la recette et enregistre également certaines métadonnées fournies par l'en-tête de réponse du serveur Web:"Content-Length" et "ETag", si l'une ou l'autre est disponible.
Si la recette est exécutée une deuxième fois, elles sont utilisées pour comparer notre copie en cache avec celle actuellement disponible à l'URL de téléchargement.
Cela signifie qu'il est possible d'exécuter la recette plusieurs fois et de savoir qu'elle ne téléchargera pas à nouveau le fichier à chaque fois, mais qu'elle vérifiera à chaque fois. -->
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <!-- C'est un processeur factice utilisé uniquement par autopkg pour arrêter le traitement de la recette si l'option "check" a été donnée. Cela permet d'autopkg d'être exécuté selon un calendrier et de ne pas exécuter un traitement complet à chaque fois, s'il le juge nécessaire.
Nous partons du principe que si nous l'avons mis en cache, nous avons déjà traité le reste de la recette, ce qui correspond généralement à toutes les étapes de post-traitement finales et à son importation dans un référentiel.
Puisque cette étape est à la fin de cette recette de téléchargement, cela n’a vraiment aucun effet; mais lorsqu'une recette téléchargée est utilisée comme base pour une recette importée dans Munki ou générant un package, cette étape devient plus utile. -->
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
<!-- Vérifie la signature de l'ensemble d'applications ou du package du programme d'installation. -->
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>comment</key>
                <string>Use wildcard matching for the app so it will also match FirefoxDeveloperEdition.app and FirefoxNightly.app</string>
                <key>input_path</key>
                <string>%pathname%/Firefox*.app</string>
                <key>requirement</key>
                <string>anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "43AQ936H96"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>