<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<dict>

<!-- (Facultatif, mais fortement recommandé) Description utile de la recette et des valeurs spécifiques à l'application que l'administrateur peut souhaiter remplacer. -->
    <key>Description</key>
    <string>Télécharge la dernière image disque Skype et l’importe dans Munki.</string>

    <!-- Une chaîne unique identifiant cette recette. Un format suggéré pour l'identifiant est une chaîne de domaine inversé suivie du type de recette et du nom du produit. -->
    <key>Identifier</key>
    <string>com.github.INSERM-TLS.munki.Skype</string>

    <!-- Ensemble de variables que l'administrateur peut remplacer sans avoir à modifier directement les paramètres ou la logique de la recette elle-même. -->
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Skype</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
<!-- (Facultatif) Implémente l'application téléchargé dans le catalog "testing" pour permettre par le suite à l'administrateur de la passer dans le catalog "Prod" si il est satisfait de la mise a jour de cette application -->
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Gardez le contact ! Appels en ligne gratuits, messagerie, appels internationaux à prix réduit vers des lignes fixes ou mobiles et Skype Entreprise pour une collaboration efficace.</string>
            <key>display_name</key>
            <string>Skype</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>

<!-- (Facultatif) Version minimale de autopkg requise pour exécuter cette recette. -->
    <key>MinimumVersion</key>
    <string>0.6.0</string>

<!-- (Facultatif) Si cette recette hérite des "Inputs" et des "Process" d'une autre recette, cela existe et correspond à l''Identifier' de la recette parent. -->
    <key>ParentRecipe</key>
    <string>com.github.INSERM-TLS.download.Skype</string>

<!-- Séquence de processeurs utilisés pour exécuter la recette, ainsi que leurs paramètres. -->
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Skype.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
<!-- Renvoie les informations de version d'un plist -->
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
<!-- Fusionne deux dictionnaires pkginfo. -->
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
<!-- Importe un ".pkg" ou une ".dmg" dans le dépôt Munki. -->
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>