<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">

<dict>

<!-- (Facultatif, mais fortement recommandé) Description utile de la recette et des valeurs spécifiques à l'application que l'administrateur peut souhaiter remplacer. -->
    <key>Description</key>
    <string>Télécharge la dernière image disque de Inkscape.</string>

<!-- Une chaîne unique identifiant cette recette. Un format suggéré pour l'identifiant est une chaîne de domaine inversé suivie du type de recette et du nom du produit. -->
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Inkscape</string>

<!-- Ensemble de variables que l'administrateur peut remplacer sans avoir à modifier directement les paramètres ou la logique de la recette elle-même. -->
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Inkscape</string>
        <key>SEARCH_URL</key>
        <string>https://inkscape.org/en/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;\/en\/release.*dmg\/dl\/)</string>
        <key>SEARCH_PATTERN1</key>
        <string>(Current stable version: (?P&lt;version&gt;[0-9]{1,2}.[0-9]{1,2}.[0-9]{1,2}))</string>
        <key>SEARCH_PATTERN2</key>
        <string>(?P&lt;dmgurl&gt;\/en\/gallery\/.*Inkscape.*dmg)</string>        
    </dict>

<!-- (Facultatif) Version minimale de autopkg requise pour exécuter cette recette. -->
    <key>MinimumVersion</key>
    <string>0.2.9</string>

<!-- Séquence de processeurs utilisés pour exécuter la recette, ainsi que leurs paramètres. -->
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
<!-- Télécharge une URL à l'aide de curl et effectue une correspondance d'expression régulière sur le texte. -->
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN1%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
<!-- Télécharge une URL à l'aide de curl et effectue une correspondance d'expression régulière sur le texte. -->
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://inkscape.org/en/release/%version%/mac-os-x/</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
<!-- Télécharge une URL à l'aide de curl et effectue une correspondance d'expression régulière sur le texte. -->
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://inkscape.org%url%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN2%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
<!-- Ce processeur télécharge une URL dans le dossier de cache de la recette et enregistre également certaines métadonnées fournies par l'en-tête de réponse du serveur Web:"Content-Length" et "ETag", si l'une ou l'autre est disponible.
Si la recette est exécutée une deuxième fois, elles sont utilisées pour comparer notre copie en cache avec celle actuellement disponible à l'URL de téléchargement.
Cela signifie qu'il est possible d'exécuter la recette plusieurs fois et de savoir qu'elle ne téléchargera pas à nouveau le fichier à chaque fois, mais qu'elle vérifiera à chaque fois. -->
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://inkscape.org%dmgurl%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
<!-- C'est un processeur factice utilisé uniquement par autopkg pour arrêter le traitement de la recette si l'option "check" a été donnée. Cela permet d'autopkg d'être exécuté selon un calendrier et de ne pas exécuter un traitement complet à chaque fois, s'il le juge nécessaire.
Nous partons du principe que si nous l'avons mis en cache, nous avons déjà traité le reste de la recette, ce qui correspond généralement à toutes les étapes de post-traitement finales et à son importation dans un référentiel.
Puisque cette étape est à la fin de cette recette de téléchargement, cela n’a vraiment aucun effet; mais lorsqu'une recette téléchargée est utilisée comme base pour une recette importée dans Munki ou générant un package, cette étape devient plus utile. -->
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>